/*
1002. 写出这个数 (20)
读入一个自然数n，计算其各位数字之和，用汉语拼音写出和的每一位数字。

输入格式：每个测试输入包含1个测试用例，即给出自然数n的值。这里保证n小于10100。

输出格式：在一行内输出n的各位数字之和的每一位，拼音数字间有1 空格，但一行中最后一个拼音数字后没有空格。
输入样例：

1234567890987654321123456789

输出样例：

yi san wu

*/

#include <stdio.h>

int main(){
	int sum = 0;					//和   变量
	char c;						//字符 变量
	char * pinyin[] = {"ling","yi","er","san","si","wu","liu","qi","ba","jiu"};

	while((c = getchar()) != '\n')
		sum = sum + (c - '0'); 			//c -'0' 是将c存放的数字字符转成对应的数字
	//100个10相加是1000
	//题目要求输入的数小于10的100次方，所以各位相加的和最大为900
	//所以只考虑到百位就可以
	if (sum /100)					//百位
		printf("%s ",pinyin[sum/100]);
	if (sum /10)					//十位
		printf("%s ",pinyin[sum/10%10]);
	printf("%s",pinyin[sum%10]);			//个位

	return 0;
}
